{"columns":[{"name":"id","type":"text"},{"name":"xata.version","type":"int4"},{"name":"xata.createdAt","type":"timestamptz"},{"name":"xata.updatedAt","type":"timestamptz"},{"name":"photos","type":"jsonb"},{"name":"name","type":"text"},{"name":"description","type":"text"},{"name":"date","type":"timestamptz"},{"name":"author","type":"text"},{"name":"metadata","type":"jsonb"}],"records":[{"author":null,"date":null,"description":"The painting \"Madonna with Saint Giovannino,\" attributed to Domenico Ghirlandaio, dates back to the 15th century and is housed in the Museo di Palazzo Vecchio in Florence. This artwork features the Virgin Mary holding the infant Jesus, accompanied by Saint John the Baptist, with a notable and controversial detail: a mysterious object in the sky that some interpret as a UFO.\n\n## Description and Context\n\nIn the painting, Mary looks down at the child while a man in the background appears to gaze at an oval-shaped object hovering above her shoulder. This figure, along with a dog at his feet, enhances the intrigue surrounding the painting. The object emits beams of light, leading some UFO theorists to claim it represents an extraterrestrial craft. However, art historians suggest that the object could symbolize an angelic presence or a star, common motifs in religious art of the time[1][2][3].\n\n## Artistic Significance\n\nGhirlandaio, known for his detailed and vibrant works, often infused his paintings with layers of meaning and iconography. The \"Madonna with Saint Giovannino\" is part of the Loeser Collection, which was bequeathed to Florence by American collector Charles Alexander Loeser. The collection is noted for its aesthetic arrangement rather than a traditional museum display, allowing visitors to appreciate the artworks in a more intimate setting[2].\n\n## Interpretations\n\nThe painting has sparked various interpretations, particularly from those interested in UFO phenomena. Some argue that the depiction of the object aligns with modern-day views of unidentified flying objects, while others maintain that it is merely a representation of divine presence or a star, as seen in other works of the period. This duality of interpretation reflects broader themes in art history, where symbols can be understood in multiple ways depending on cultural and temporal contexts[2][3][4].\n\nIn conclusion, \"Madonna with Saint Giovannino\" remains a fascinating subject of discussion, blending religious iconography with modern interpretations of the unknown.\n","id":"rec_cqf29kn206kua2cork10","metadata":{"artist":"Domenico Ghirlandaio","created":"15th century"},"name":"Madonna with Saint Giovannino","photos":[{"attributes":{"height":500,"width":800},"enablePublicUrl":true,"id":"l26n7gasop27d78q6u5oitiors","mediaType":"image/jpeg","name":"EWtVbjlXQAAdQkW.jpg","signedUrlTimeout":600,"size":56718,"storageKey":"a79vcq1okh1ard169f8sfto2ks","uploadKey":"cqf2a77206kua2cork1g","uploadUrlTimeout":86400,"version":0},{"attributes":{"height":659,"width":480},"enablePublicUrl":true,"id":"oo298djfch6234tsbp6c469hv8","mediaType":"image/jpeg","name":"The_Madonna_with_Saint_Giovannino.jpg","signedUrlTimeout":600,"size":114005,"storageKey":"lhk7mial4d6rbaed5s0356rqao","uploadKey":"cqf2a77206kua2cork20","uploadUrlTimeout":86400,"version":0}],"xata":{"createdAt":"2024-07-22 09:22:26.460341+00","updatedAt":"2024-07-22 09:23:40.566084+00","version":1}},{"author":null,"date":null,"description":"\"The Annunciation with Saint Emidius\" is an altarpiece created by the Italian artist Carlo Crivelli in 1486. This significant work is housed in the National Gallery in London and measures 207 cm × 146.7 cm. It was originally commissioned for the Church of SS. Annunziata in Ascoli Piceno, Italy, to commemorate the town's self-governance granted by Pope Sixtus IV in 1482.\n\nThe piece has garnered attention from UFO enthusiasts due to the presence of a disc-shaped object in the sky above the Virgin Mary. This has led to claims that the painting may depict an unidentified aerial phenomenon, drawing parallels to contemporary discussions surrounding UAPs (Unidentified Aerial Phenomena).\n\n## UAP and UFO Claims\n\n1. **Disc-Shaped Object**: The painting features a prominent disc-shaped object above Mary, which some interpret as a UFO. This interpretation aligns with a broader trend of analyzing historical artworks for potential evidence of extraterrestrial encounters, suggesting that such phenomena may have been recorded in various forms throughout history[1][3].\n\n2. **Cultural Context**: The context of the painting, created during a time of political change in Ascoli Piceno, adds complexity to its interpretation. The inclusion of Saint Emidius, the town's patron saint, holding a model of the city, emphasizes local pride and divine protection, which may overshadow the more sensational interpretations related to UFOs[2][4].\n\n3. **Historical Interpretations**: While some enthusiasts focus on the UFO aspect, art historians typically argue that the object is likely symbolic, representing divine light or the Holy Spirit rather than an extraterrestrial craft. This reflects a tension between traditional art interpretation and modern UAP theories, highlighting how contemporary interests can influence the understanding of historical art[1][2][4].\n\n4. **Public Interest in UAPs**: Recent governmental disclosures regarding UAPs have revived public interest in the subject, prompting a re-examination of historical narratives and artworks. This cultural shift encourages a broader interpretation of symbols and meanings in art, including those found in \"The Annunciation with Saint Emidius\" [3][4].\n\nIn summary, the intersection of \"The Annunciation with Saint Emidius\" and UAP claims illustrates how historical artworks can be reinterpreted through the lens of modern phenomena, reflecting evolving cultural narratives about the unknown.\n","id":"rec_cqf2crn206kua2cork2g","metadata":{"artist":"Carlo Crivelli","created":"1486"},"name":"The Annunciatio, with Saint Emidius","photos":[{"attributes":{"height":1600,"width":1529},"enablePublicUrl":true,"id":"84b87h5ell53j84l943nnhiqu0","mediaType":"image/jpeg","name":"641443@2x.jpg","signedUrlTimeout":600,"size":1392846,"storageKey":"5hbkq2q921549d2l8ou338hano","uploadKey":"cqf2crn206kua2cork30","uploadUrlTimeout":86400,"version":0},{"attributes":{"height":2291,"width":1141},"enablePublicUrl":true,"id":"72sitik4554phdrkfsm0vilu48","mediaType":"image/png","name":"annunciation.png","signedUrlTimeout":600,"size":5802285,"storageKey":"80fffe1cbt05n6glk6el91gcqs","uploadKey":"cqf2crv206kua2cork3g","uploadUrlTimeout":86400,"version":0},{"attributes":{"height":4226,"width":2996},"enablePublicUrl":true,"id":"klt8bqi6ol71nd8mgbpom2ho10","mediaType":"image/jpeg","name":"The_Annunciation,_with_Saint_Emidius_-_Carlo_Crivelli_-_National_Gallery.jpg","signedUrlTimeout":600,"size":5866909,"storageKey":"3aoqoctm2l25t65sqds4j0ech0","uploadKey":"cqf2crv206kua2cork40","uploadUrlTimeout":86400,"version":0}],"xata":{"createdAt":"2024-07-22 09:29:20.010084+00","updatedAt":"2024-07-22 09:29:20.010084+00","version":0}},{"author":null,"date":"1719-01-01 00:00:00+00","description":"De Gelder was one of Rembrandt’s last pupils and his paintings of Biblical scenes bear the Dutch Master’s heightened emotionalism. His circa 1710 work captures the baptism of Jesus by John the Baptist at the River of Jordan, spotlit by beams from a huge disc in the sky. It’s ostensibly a representation of “the Spirit of God descending like a dove and alighting on [Jesus],” according to Matthew 3:16. Or could it be de Gelder was trying to tell us something about the audience at Jesus’s baptism?\n\n","id":"rec_cqqdo58uecie37hlmu5g","metadata":{"artist":"Aert de Gelder"},"name":"Baptism of Christ","photos":[{"enablePublicUrl":true,"id":"5p76dsdpjl60bfkg6sd08mmiq4","mediaType":"image/webp","name":"De Gelder Baptism Christ.webp","signedUrlTimeout":600,"size":80752,"storageKey":"kgubvqpivd5qv510u0ecb31epo","uploadKey":"cqqdo58uecie37hlmu60","uploadUrlTimeout":86400,"version":0}],"xata":{"createdAt":"2024-08-08 14:54:14.313618+00","updatedAt":"2024-08-08 14:54:14.313618+00","version":0}},{"author":null,"date":"1478-01-01 00:00:00+00","description":"In the background of this piece, the viewer can see a shepherd looking up at an angel coming out of the clouds. Once again, this shepherd also shrouds his eyes from the light to get a better look. The angel is halfway out of the clouds, while the lower part of his body, from the knees downwards, is still in the clouds. There’s a beaming light around his knees, shown by gold gilding.\n\n \n\nSome art historians believe this greyish blob could be Ghirlandaio’s interpretation of a brilliant star. The art historians who claim this point to the left-hand side of the paintings, which shows another celestial event—the Nativity star. There are also art historians who think this blob of grey could be a forgotten Christian symbol.","id":"rec_cqqdpoguecie37hlmu7g","metadata":{"artist":"Vincenzo Foppa,"},"name":"Adoration of the Child with St. Benedict and Angels ","photos":[{"enablePublicUrl":true,"id":"rdbilioppt1131c67cu2g82js4","mediaType":"image/webp","name":"Adoration Child Saint Benedict Angels.webp","signedUrlTimeout":600,"size":142854,"storageKey":"kgubvqeh6t67d1qog5q80c33pc","uploadKey":"cqqdpoguecie37hlmu80","uploadUrlTimeout":86400,"version":0}],"xata":{"createdAt":"2024-08-08 14:57:38.510565+00","updatedAt":"2024-08-08 14:57:38.510565+00","version":0}}],"total":0}
