{"columns":[{"name":"id","type":"text"},{"name":"xata.version","type":"int4"},{"name":"xata.createdAt","type":"timestamptz"},{"name":"xata.updatedAt","type":"timestamptz"},{"name":"claim","type":"text"},{"name":"event","type":"text"},{"name":"summary","type":"text"},{"name":"witness","type":"text"},{"name":"documentation","type":"jsonb"},{"name":"date","type":"timestamptz"},{"name":"organization","type":"text"}],"records":[{"claim":"I've been so lucky to have flown to the moon, but I sure would like to fly to some of those [UFO] places.","date":null,"documentation":[],"event":null,"id":"rec_cocrpk523jsre5gha9cg","organization":null,"summary":null,"witness":"rec_cobdfd4jmvif9dabl0t0","xata":{"createdAt":"2024-04-12 22:59:28.207849+00","updatedAt":"2024-04-12 22:59:28.207849+00","version":0}},{"claim":"I've been involved in scores of accidents in the air. I've seen many, many things in the sky that I couldn't explain.","date":null,"documentation":[],"event":null,"id":"rec_cocrpk523jsre5gha9d0","organization":null,"summary":null,"witness":"rec_cobdfd4jmvif9dabl110","xata":{"createdAt":"2024-04-12 22:59:28.207849+00","updatedAt":"2024-04-12 22:59:28.207849+00","version":0}},{"claim":"I've been asked [about UFOs] and I've said publicly I thought they were somebody else, some other civilization.","date":null,"documentation":[],"event":null,"id":"rec_cocrpk523jsre5gha9e0","organization":null,"summary":null,"witness":"rec_cobdfd4jmvif9dabl160","xata":{"createdAt":"2024-04-12 22:59:28.207849+00","updatedAt":"2024-04-12 22:59:28.207849+00","version":0}},{"claim":"I don't know what it was, other than not an aircraft as we know it... I tried to get closer to it and it rapidly took off. It was a intense bright light.","date":null,"documentation":[],"event":"rec_cobdg3tbjt595h6375p0","id":"rec_cocrpk523jsre5gha9eg","organization":null,"summary":null,"witness":"rec_cobdfd4jmvif9dabl0p0","xata":{"createdAt":"2024-04-12 22:59:28.207849+00","updatedAt":"2024-04-12 22:59:28.207849+00","version":0}},{"claim":"These things would be out there all day.","date":null,"documentation":[],"event":"rec_cobdg3tbjt595h6375p0","id":"rec_cocrpk523jsre5gha9f0","organization":null,"summary":null,"witness":"rec_cobdfd4jmvif9dabl1ig","xata":{"createdAt":"2024-04-12 22:59:28.207849+00","updatedAt":"2024-04-12 22:59:28.207849+00","version":0}},{"claim":"This is a difficult one to explain. You have rotation, you have high altitudes. You have propulsion, right? I don't know. You tell me.","date":null,"documentation":[],"event":"rec_cobdg3tbjt595h6375p0","id":"rec_cocrpk523jsre5gha9fg","organization":null,"summary":null,"witness":"rec_cobdfd4jmvif9dabl0gg","xata":{"createdAt":"2024-04-12 22:59:28.207849+00","updatedAt":"2024-04-12 22:59:28.207849+00","version":0}},{"claim":"There were a number of different incidents.","date":null,"documentation":[],"event":"rec_cobdg3tbjt595h6375p0","id":"rec_cocrpk523jsre5gha9g0","organization":null,"summary":null,"witness":"rec_cobdfd4jmvif9dabl0gg","xata":{"createdAt":"2024-04-12 22:59:28.207849+00","updatedAt":"2024-04-12 22:59:28.207849+00","version":0}},{"claim":"If we extrapolate based on the best information we have available to us, we have to come to the conclusion that … other life probably exists out there and perhaps in many places","date":null,"documentation":[],"event":null,"id":"rec_cocrpk523jsre5gha9gg","organization":null,"summary":null,"witness":"rec_cobdfd4jmvif9dabl1d0","xata":{"createdAt":"2024-04-12 22:59:28.207849+00","updatedAt":"2024-04-12 22:59:28.207849+00","version":0}},{"claim":"At no time, when the astronauts were in space were they alone: there was a constant surveillance by UFOs","date":null,"documentation":[],"event":null,"id":"rec_cocrpk523jsre5gha9h0","organization":null,"summary":null,"witness":"rec_cobdfd4jmvif9dabl1jg","xata":{"createdAt":"2024-04-12 22:59:28.207849+00","updatedAt":"2024-04-12 22:59:28.207849+00","version":0}},{"claim":" The sun does not revolve around the earth.\n The United States government has been in business with little gray\n extraterrestrials for about 20 years.\n \n The first truth state here got Giordano Bruno burned at the stake\n in 1600 for daring to propose it was real.  The second truth has\n gotten far more people killed trying to state it publicly than\n will ever be known.","date":null,"documentation":[{"enablePublicUrl":false,"id":"u257neettp0prffgghm7d122q4","mediaType":"text/plain","name":"THE UFO COVERUP- John Lear - Aug 25 1988.txt","signedUrlTimeout":600,"size":22844,"storageKey":"falakds7ll4rlav3lbfoentumo","uploadKey":"coeu4vl23jsre5ghhvcg","uploadUrlTimeout":86400,"version":0},{"enablePublicUrl":false,"id":"quq8hdkf693uv7fct4q8cieonk","mediaType":"application/pdf","name":"john.lear.letter.pdf","signedUrlTimeout":600,"size":85075,"storageKey":"rq4q9n7io938hdimtogqn4fcb4","uploadKey":"coeu4vt23jsre5ghhvd0","uploadUrlTimeout":86400,"version":0}],"event":null,"id":"rec_cocrpk523jsre5gha9hg","organization":null,"summary":"On December 29, 1987, Lear posted a Statement to ParaNet, an early bulletin board system dedicated to the paranormal, claiming that the US government has close contacts with extraterrestrials and were secretly \"promoting\" films like E.T.: The Extra-Terrestrial and Close Encounters of the Third Kind to influence the public to see extraterrestrials as \"space brothers\".[26] The document was revised on January 14, again in March, with a final revision dated August 25, 1988. The document describing a secret government committee, Majestic 12, making a treaty with Gray aliens, only to later realize they've been deceived by the aliens.[27][28]\n\nThe Statement claims a UFO coverup has been underway for 40 years. Lear argues that \"Germany may have recovered a flying saucer in 1939\" and discusses the 1946 American military investigation into the Ghost rockets reported over Sweden. The Statement argues that many in the \"original group\" of insiders committed suicide, most notably James Forrestal. According to the narrative, Truman formed a group of twelve insiders, known as Majestic 12, to investigate the matter. The Statement lists three saucer crashes: one near Roswell. another near Aztec, New Mexico and a third near Laredo, Texas. According to the Statement, the US government covered a \"total, thorough and sweeping cover-up to include the use of 'deadly force'.\"\n\nThe Statement references the 1952 Washington, D.C., UFO incident and a 1964 meeting with aliens at Holloman Air Force Base. Lear's Statement includes government-sanctioned alien abductions, alien implants, and Alien-Human hybrids. The Statement asserts that \"some of the nations missing children had been used for secretions and other parts required by the aliens\". Lear described UFOs in connect with cattle mutilations and even claims that human mutilations have occurred. Lear talks about Dulce Base and an altercation between aliens and the US military that led to 66 human casualties.\n\nLear's statement influenced Thomas Allen LeVesque, pen name \"Jason Bishop III\", who later admitted to fabricating stories about Dulce Base. [29][30]","witness":"rec_cobdfd4jmvif9dabl17g","xata":{"createdAt":"2024-04-12 22:59:28.207849+00","updatedAt":"2024-04-16 02:29:19.555876+00","version":3}},{"claim":"UFO followed Apollo 11 to the moon","date":null,"documentation":[],"event":"rec_cokjlu2o50dbfnaci6r0","id":"rec_cokjngqo50dbfnaci6s0","organization":null,"summary":"\"On Apollo 11 in route to the Moon, I observed a light out the window that appeared to be moving alongside us. There were many explanations of what that could be, other than another spacecraft from another country or another world - it was either the rocket we had separated from, or the 4 panels that moved away when we extracted the lander from the rocket and we were nose to nose with the two spacecraft. So in the close vicinity, moving away, were 4 panels. And I feel absolutely convinced that we were looking at the sun reflected off of one of these panels. Which one? I don't know. So technically, the definition could be 'unidentified.'\"","witness":"rec_cokjn8kuttukesrsanu0","xata":{"createdAt":"2024-04-24 17:05:07.70179+00","updatedAt":"2024-04-24 17:05:07.70179+00","version":0}},{"claim":"There's a number of extraterrestrial vehicles out there that have been spotted. I happen to be privileged enough to be in on the fact that we've been visited on this planet, and the UFO phenomenon is real.","date":null,"documentation":[],"event":"rec_cokjohn758af7femso8g","id":"rec_cokjol7758af7femso90","organization":null,"summary":null,"witness":"rec_cobdfd4jmvif9dabl0t0","xata":{"createdAt":"2024-04-24 17:07:32.181349+00","updatedAt":"2024-04-24 17:07:32.181349+00","version":0}},{"claim":"I believe that these extraterrestrial vehicles and their crews are visiting this planet from other planets, which obviously are a little more technically advanced than we are here on Earth. ","date":null,"documentation":[],"event":null,"id":"rec_cocrpk523jsre5gha9dg","organization":null,"summary":null,"witness":"rec_cobdfd4jmvif9dabl110","xata":{"createdAt":"2024-04-12 22:59:28.207849+00","updatedAt":"2024-04-24 17:08:36.826541+00","version":1}},{"claim":"\"Yeah, I think there’s a cover up\". \"I can’t tell you how many conversations I’ve had with high-ranking officials that have told me that America really can’t handle this stuff.\"","date":null,"documentation":[],"event":null,"id":"rec_cor05fctgl04ngb6hab0","organization":null,"summary":"","witness":"rec_cor02rooepqha1jsmgn0","xata":{"createdAt":"2024-05-04 09:41:17.964392+00","updatedAt":"2024-05-04 09:41:17.964392+00","version":0}},{"claim":"\"I do know from the people I trust, who have had access to some of these programs, that there are different types of non-human intelligence visiting us whose intentions we do not know.\"","date":null,"documentation":[],"event":null,"id":"rec_cor09jctgl04ngb6hacg","organization":null,"summary":"In an interview with Liberation Times, retired Rear Admiral and former Acting Administrator of the National Oceanic and Atmospheric Administration (NOAA), Tim Gallaudet, underscored the potential threat of Unidentified Anomalous Phenomena (UAP) to submariners. \n\nHe also called for greater involvement and action from the White House’s National Security Council in directing the Department of Defense (DoD) and Intelligence Community to provide greater transparency on the topic.\n\nFollowing the publication of his recent white paper addressing the undersea aspect of UAP for the Sol Foundation, Gallaudet conveyed his eagerness to participate in a U.S. government-led investigation into UAP occurring beneath the ocean, framed by his informed belief that some of the phenomena may represent a form of higher non-human intelligence. \n\nGallaudet told Liberation Times:\n\n“I want to look in the oceans for UAP and evidence of higher non-human intelligence because I know the area really well. I know all the collection systems out there and the universities and government agencies that do ocean exploration and research. \n\n“I want to pursue the study of UAP in the oceans to add to the overall body of knowledge. \n\n“Why just limit ourselves to looking up when we know if we look below we'll find that evidence too?”\n\nGallaudet, a distinguished veteran and esteemed oceanographer, has engaged in discussions with both retired and active submariners. They shared their first-hand experiences with what appeared to be exceptionally advanced submerged crafts detected through sophisticated military sensor systems.\n\nOne retired submariner was referred by Gallaudet to the DoD’s UAP office, known as the All-domain Anomaly Resolution Office (AARO).\n\nIn the 1980s, while serving aboard a U.S. submarine in the North Atlantic, the retired submariner witnessed a perplexing scenario: sonar suggested the presence of a Russian torpedo closing in on the vessel, but it soon became apparent that the object had no clear explanation. \n\nGallaudet told Liberation Times:\n\n“The submariner was in the North Atlantic during a very significant storm, when you had 40-foot waves. The waves mix the water up and create a lot of noise, making it really hard for submarines to find each other. \n\n“He did not expect to see any submarine contacts because of the high sea state. But the submarine encountered an object that started closing in on it rapidly. \n\n“It was so fast that the signature had every indication that it was a Russian torpedo. The crew had trained for this scenario. But it didn't make any sense for Russian submarines to be in that area and to be able to detect their submarine because of the high noise and sea state.”\n\nDemonstrating the seriousness of the situation, Gallaudet explained how the submarine’s crew were forced to take emergency action:\n\n“They were surprised and ended up taking evasive manoeuvres. They dove deep near the crush depth of the submarine.”\n\nBut strangely, the object slowed down as it approached the submarine, to the astonishment of the crew. \n\nGallaudet explained:\n\n“The object slowed down as it approached and then went around the submarine to the stern and began slowly trailing it. \n\n“It trailed the submarine for a time and then rapidly moved out of the area.”\n\nAs a highly distinguished naval veteran who has extensive knowledge and experience of undersea phenomena and military systems, Gallaudet has struggled to find an explanation for the encounter:\n\n“It had no explanation”, Gallaudet asserted.\n\n“Our technology couldn't do that. The Russians didn't have this in the 1980s, nor do they now -  so it cannot be explained.”\n\nFollowing the retired submariner’s interview with the AARO, he was informed that they would look into the acoustic datasets, which are held by Johns Hopkins University. Since the interview took place, no further information or update has been provided by the Office.\n\n“I don't know what the status of that is.\n\n“I'm almost certain it's not resolved in the nature of the movement of the object that was detected on the sonar.”\n\nThe manner in which the DoD has handled such threats has led to frustration among numerous active and retired military and intelligence officials. \n\nMany of them have communicated with individuals who have held high-security clearances, who allege to have been involved in covert programs focused on the retrieval and analysis of craft and biological entities of advanced non-human intelligence.\n\nGallaudet maintains contact with highly credible first-hand whistleblowers who assert, through programs they have worked on, that advanced multiple species of non-human intelligence in various crafts have visited and continue to visit Earth.\n\nGallaudet told Liberation Times:\n\n“I do know from the people I trust, who have had access to some of these programs, that there are different types of non-human intelligence visiting us whose intentions we do not know.” \n\nBut for Gallaudet, an experienced oceanographer, the allegation of multiple species of higher intelligence visiting the Earth is of no surprise, given the diversity of life the planet alone can support:\n\n“I guess it’s what you'd expect when you think about the nature of life just on this planet. \n\n“So why wouldn’t it be different for species that are of higher intelligence than us? It’s not a real stretch when you consider the diversity of life on this planet.”\n\nGallaudet, shares the frustrations of many other military and intelligence insiders, following the gutting of extensive UAP transparency language, known as the ‘UAP Disclosure Act’ (UAPDA) proposed by Senators Chuck Schumer and Mike Rounds last year.\n\nGallaudet views the lack of understanding surrounding purportedly advanced non-human intelligence linked to certain UAP sightings as a significant threat. \n\nHe stresses the importance of transparency, research and official acknowledgement to effectively address this issue.\n\n“We still don't understand their intentions, which is worthy of serious research and discussion, instead of putting our heads in the sand.”\n\nGallaudet believes that the frustration surrounding the AARO's recent attempt, through its latest historical report, to dismiss allegations of advanced non-human intelligence visiting Earth, should be directed towards the White House and its National Security Council.","witness":"rec_cor08hsqc39mil7t3pk0","xata":{"createdAt":"2024-05-04 09:50:05.047701+00","updatedAt":"2024-05-04 09:50:05.047701+00","version":0}},{"claim":"In Building 8 at Johnson Space Center, Houston, there is someone whose full time job is to airbrush UFOs from images, since they are so commonly captured.\nHe found a US Navy spreadsheet entitled ‘Non-terrestrial officers’. McKinnon admits these words “can be interpreted in various ways,” but one thing is for sure: given the name, we know they’re not based on Earth.\nMcKinnon says there were maybe 25 rows on the excel spreadsheet with officers’ ranks and names, and that the ships had the prefix ‘USS’ just like American sea vessels.\nHe claims there is evidence of “material transfer between ships”, of which he says there are possibly eight to ten.","date":"2001-02-01 00:00:00+00","documentation":[],"event":null,"id":"rec_cosjkhi45ipgmae5fdeg","organization":null,"summary":"McKinnon says he found a log that listed non-terrestrial officers. Titled \"Non-Terrestrial Officers.\" It contained names and ranks of U.S. Air Force personnel who are not registered anywhere else. It also contained information about ship-to-ship transfers, but I've never seen the names of these ships noted anywhere else. He doesn’t believe that these were aliens, but he believes this to be evidence that the U.S. military has a secret battalion in space. Some of these logs were ship to ship transfers, but he says he was usually smoking pot while he hacked, so that prevented him from remembering the names of the ships. He also said he found a high definition picture of a large cigar shaped object over the northern hemisphere. The most shocking find to McKinnon, the one he thought would be his ace in the hole negotiating with the US.. government, was what he found hacking into the systems of U.S. Space Command. McKinnon says he found a log that listed non-terrestrial officers. He doesn’t believe that these were aliens, but he believes this to be evidence that the U.S. military has a secret battalion in space. Some of these logs were ship to ship transfers, but he says he was usually smoking pot while he hacked, so that prevented him from remembering the names of the ships. McKinnon told the Gaurdian: “I was smoking a lot of dope at the time. Not good for the intellect.”\n\nThere are rumors that he has talked about the names of two of the ships he saw on the transfer logs, the names of the ships allegedly being the USSS LeMay and the USSS Hillenkoetter. Typically Navy ship names just have two S’, an acronym for United States Ship, however there are three S’ here, presumably standing for United States Space Ship. The names of the ships are also significant.\n\nGeneral Curtis LeMay (credit: USAF)\nGeneral Curtis LeMay (credit: USAF)\nGeneral Curtis LeMay was friends with retired Air Force Reserve Major General and former U.S. Senator from Arizona, Barry Goldwater. Goldwater believed there was a UFO cover-up deep within the government, and suspected that his friend LeMay knew about it. There were rumors that there was UFO evidence being held in a secret room at Wright-Patterson Air Force Base called the blue room. Goldwater told the media several times that when he asked LeMay about this room, LeMay got upset and told him, “Not only can’t you get into it but don’t you ever mention it to me again.” Open Minds magazine will have an article going more into depth on Goldwater in the second issue.\n\nThe second ship’s namesake, Admiral Roscoe Hillenkoetter, was the first director of the CIA, and was also a member of a UFO research organization, the National Investigations Committee on Aerial Phenomena (NICAP). In 1960, the New York Times reported that Hillenkoetter had sent a letter to Congress that included this statement: “Behind the scenes, high-ranking Air Force officers are soberly concerned about UFOs. But through official secrecy and ridicule, many citizens are led to believe the unknown flying objects are nonsense.”\n\nAdmiral Hillenkoetter (credit: USN)\nAdmiral Hillenkoetter (credit: USN)\nAlthough Hillenkoetter fought for the end of UFO secrecy, he eventually stopped commenting on the matter. Conspiracists also find Hillenkoetter intriguing because his name appears in debunked alleged secret documents that were leaked to UFO researchers. They list Hillenkoetter as a member of the infamous Majestic 12 group, an organization rumored to have been made up of high ranking military officers and civilians that was supposedly created by President Truman to initially manage the UFO issue.\n\nHowever, the fact that McKinnon actually released names of these ships is also a just a rumor, thus far there are no sources for this claim.\n\nSo there we have it, the UFO picture that McKinnon saw and the ship rosters were all he had, and unfortunately for him, they were not enough to scare the government into going easy on him. Instead he has been fighting a long multi-year battle to keep from being extradited to the US, a fight that he is losing. So far every British court he has appealed to has denied his stay.\n\nThe US government is really throwing the book at him, alleging that he took down military computers making the U.S. vulnerable soon after 911. McKinnon denies those claims, and says that he was able to observe many hackers from around the world accessing the networks he was on at the same time he was on them. Many believe that McKinnon may just be a scapegoat.","witness":"rec_cobdfd4jmvif9dabl0vg","xata":{"createdAt":"2024-05-06 20:15:02.300631+00","updatedAt":"2024-05-06 20:15:02.300631+00","version":0}},{"claim":"There was a whole fleet of them. They were traveling against the wind at high speeds.","date":null,"documentation":[{"enablePublicUrl":false,"id":"eslrnib5hl16pfhv92r7sncs90","mediaType":"text/plain","name":"halt-tape-transcript.txt","signedUrlTimeout":600,"size":18480,"storageKey":"3ef4q9hcv97shb9p41a6e2fbls","uploadKey":"cp2a2934f9p514bqbb9g","uploadUrlTimeout":86400,"version":0},{"enablePublicUrl":false,"id":"2817st0dtp30t81igljh5nt9tg","mediaType":"image/webp","name":"rendlesham-sketch.webp","signedUrlTimeout":600,"size":57718,"storageKey":"ri53j6040t47fe47ecd18egp64","uploadKey":"cp2a2934f9p514bqbba0","uploadUrlTimeout":86400,"version":0},{"enablePublicUrl":false,"id":"jjcvcs5cb90438to2lobs4eeus","mediaType":"image/webp","name":"rendlesham.webp","signedUrlTimeout":600,"size":73734,"storageKey":"b2a33j931h7idcqfsf7rvo6tnk","uploadKey":"cp2a2934f9p514bqbbag","uploadUrlTimeout":86400,"version":0}],"event":"rec_cobdg3tbjt595h63762g","id":"rec_cocrpk523jsre5gha9c0","organization":null,"summary":null,"witness":"rec_cobdfd4jmvif9dabl18g","xata":{"createdAt":"2024-04-12 22:59:28.207849+00","updatedAt":"2024-05-15 11:48:52.603243+00","version":3}},{"claim":"The UFO phenomenon itself is in control of the disclosure process.","date":null,"documentation":[{"enablePublicUrl":false,"id":"786mptc5el3nf92ulhjn4eaij4","mediaType":"application/pdf","name":"Incommensurability_Orthodoxy_and_the_Physics_of_Hi.pdf","signedUrlTimeout":600,"size":161216,"storageKey":"scqt09hnl960lfmujpeurvn1ds","uploadKey":"cp2epqqvodm5j2h6bjt0","uploadUrlTimeout":86400,"version":0}],"event":null,"id":"rec_cp2eomt4mibkl2ugm0rg","organization":null,"summary":"","witness":"rec_cp2eo5avodm5j2h6bjs0","xata":{"createdAt":"2024-05-15 17:09:47.498461+00","updatedAt":"2024-05-15 17:12:11.643769+00","version":1}},{"claim":"Worldwide UAP Back-Engineering Program Confirmed by Internal Memo from Canadian Government\n","date":"2023-03-22 00:00:00+00","documentation":[{"enablePublicUrl":false,"id":"d1abi74r4h0a16cfbbvb41mlig","mediaType":"application/pdf","name":"Defence+Research+and+Development+Canada+in+possession+of+recovered+UP+material.pdf","signedUrlTimeout":600,"size":3315999,"storageKey":"mq497lbif14ahffgo4nlu07bgk","uploadKey":"cq5avsb29bhdoikd5bl0","uploadUrlTimeout":86400,"version":0}],"event":null,"id":"rec_cq5avsb29bhdoikd5bkg","organization":"rec_cq5aum329bhdoikd5bjg","summary":"The existence of an international recovered UAP materials research program amongst the U.S. and key intelligence allies has been revealed through a recent internal government memo sent to the Canadian Minister of Defence from a Member of Parliament (MP) who has attended briefings with “American officials” regarding UAP. In addition to bringing this Foreign Material Program (FMP) to the Minister’s attention, the MP is urging the Canadian government to prepare for potential public announcements regarding UAP that might be made by the nations participating in the AUKUS security program in the coming months.\n\nThe memo in question, obtained by investigative journalists Jeremy Corbell and George Knapp and titled “Defence Research and Development Canada in possession of recovered UAP material”, was sent by Brandon-Souris MP Larry Maguire to the Canadian Minister of Defence, Anita Anand; in the memo, Maguire informs Minister Anand that through his “meetings with American officials” he has learned that “the United States Senate Select Committee on Intelligence and Senate Committee on Armed Services have been undertaking in-camera hearings with government and military subject matter experts on the recovery and exploitation of physical material from Unidentified Aerial Phenomena (UAP).”\n\nMaguire also states that, through records “publicly traceable to circa 1950,” Defence Research and Development Canada (DRDC, Canada’s counterpart to the Defense Advanced Research Projects Agency (DARPA)), Canada “has participated in efforts to analyze UAP” using “recovered foreign material” through a program called “the Five Eyes Foreign Material Program (FMP)… sponsored by the Canadian Forces Intelligence Command aligned with several intelligence sharing arrangements and treaties.”","witness":null,"xata":{"createdAt":"2024-07-07 15:10:42.213575+00","updatedAt":"2024-07-07 15:10:42.213575+00","version":0}},{"claim":"US Govt Has Been In Touch With Aliens For Years","date":"2020-12-08 00:00:00+00","documentation":[],"event":null,"id":"rec_cq5bhk43egbkt99udu0g","organization":null,"summary":"A \"galactic federation\" has been waiting for humans to \"reach a stage where we will understand... what space and spaceships are,\" Haim Eshed said. Eshed said cooperation agreements had been signed between species, including an \"underground base in the depths of Mars\" where there are American astronauts and alien representatives.\n\n\"There is an agreement between the U.S. government and the aliens. They signed a contract with us to do experiments here,\" he said.\n\nEshed added that President Donald Trump was aware of the extraterrestrials' existence and had been \"on the verge of revealing\" information but was asked not to in order to prevent \"mass hysteria.\"\n\n\"They have been waiting until today for humanity to develop and reach a stage where we will understand, in general, what space and spaceships are,\" Eshed said, referring to the galactic federation.","witness":"rec_cq5bgas3egbkt99udtvg","xata":{"createdAt":"2024-07-07 15:48:32.440191+00","updatedAt":"2024-07-07 15:48:32.440191+00","version":0}},{"claim":"We have a lot of high-resolution photos of UFOs or Alien Spaceships and I can testify before Congress.\n","date":"2001-05-09 00:00:00+00","documentation":[{"enablePublicUrl":false,"id":"t41k5rubnd0ob5uip2n8fv6s48","mediaType":"video/mp4","name":"Reddit - Dive into anything.mp4","signedUrlTimeout":600,"size":10487246,"storageKey":"vfk60afd9d4a96mch7aputh56o","uploadKey":"cqbv3vn206kua2coon9g","uploadUrlTimeout":86400,"version":0}],"event":null,"id":"rec_cqbv3vn206kua2coon90","organization":"rec_cobdhj5bjt595h6377eg","summary":"Good morning, everyone. My name is Donna Hare, and I worked at Filco Ford Aerospace for, from 1967 to 1981. During that time, I was a design illustrator, draftsman.\n\nI did the launch slides and landing slides and also projection plotting boards, lunar maps for NASA. We were a contractor, but most of the time I worked on site, excuse me, in building eight. I had the opportunity to do extra work during downtime, which was between missions.\n\nAnd I walked into a photo lab, which was the NASA lab, across the hallway. I had a secret clearance, which is not that high, but I was able to go into restricted areas, which this was at the time. I was talking to one of the texts in there, and he drew my attention to a photograph, a NASA photograph.\n\nIt had a dot on it. And I said, what is that? Well, he drew my attention to it, and I said, is that a dot on the emulsion? And he said, and he's smiling, and he has his hands crossed. And he said, round dots on the emulsion don't leave round shadows on the ground.\n\nAnd this was an aerial photograph of the earth, I'm assuming the earth because it had pine trees on it, and the shadows of the craft, or whatever it was, were in the same angle as the trees, and by its very nature, UFO. And I wanted to clarify that to a gentleman that was talking to me means. Unidentified so I did not know what this was, but I realized at this point that it's very secret, that it was kept secret because I asked him, what are you going to do with this piece of information? And he said, we always airbrush these out before we sell them to the public.\n\nSo they're pesky little creatures appearing on this photograph they wanted to get rid of. After that, I decided I would ask questions to other people that work there. And I found that I had to ask them away from the site and not on site.\n\nA guard told me that he was asked to burn some photographs and not to look at them.","witness":"rec_cqbv0orefvv9nms30qig","xata":{"createdAt":"2024-07-17 16:31:58.87629+00","updatedAt":"2024-07-17 16:31:58.87629+00","version":0}},{"claim":"The US government is set to unveil its alien secrets by October 18, 2024. Daniel Sheehan, who has been advocating for \"disclosure\" for several years, claims that a 64-page document signed by a bipartisan group of senators was condensed into a shorter bill containing a crucial deadline for disclosure. He claims the bill, passed into law on December 22, 2023, initiated a 300-day countdown.\n","date":"2024-06-04 00:00:00+00","documentation":[],"event":null,"id":"rec_cqf224u36t01tjk3eeng","organization":"rec_cqf251e36t01tjk3eeo0","summary":" Daniel Sheehan, a vocal advocate for disclosing the Pentagon's encounters with extraterrestrials, disclosed this information on the Freedom Pact podcast. \n\"The reality is the 24-page bill that was passed by the House and therefore has been passed into law and signed by President Biden,\" Sheehan stated.\n\n\nHe continued, \"The law has now mandated that all six of our United States military services, all 18 of our United States intelligence agencies, all 32 of our United States defense department agencies are all ordered to gather together every single piece of information they have acquired pertaining to the UFO phenomenon and non-human intelligence that is understood to be responsible for it.\n\n\"They are to gather that all together and have it available in a digitized and retrievable form by October 18 of 2024,\" reports the Daily Star. The bill is said to include any UFO data over 25 years old that was previously classified. This would encompass some of the most renowned encounters, such as the Roswell Incident, the Phoenix Lights, and perhaps the most persuasive sighting, the lesser-known 1957 RB-47 encounter.\n\nDaniel claims that the US government is “setting up a controlled disclosure programme to get this information rolled out to the American people, and to the world, over a seven-year period”.\n\nHe claims to represent a number of whistleblowers within the US military who have yet to reveal their names publicly. One told him how a crashed alien spacecraft appeared to “distort space and time” and seemed to be “bigger on the inside”.","witness":"rec_cqf1tu7206kua2corjug","xata":{"createdAt":"2024-07-22 09:06:27.647919+00","updatedAt":"2024-07-22 09:13:06.39637+00","version":1}},{"claim":"Sean Kirkpatrick, the director of the Pentagon's All-Domain Anomaly Resolution Office (AARO), has suggested the possibility of an alien mothership in our solar system.","date":"2024-03-09 00:00:00+00","documentation":[{"enablePublicUrl":false,"id":"0ucpb6hkit0rv7gggmulqeme7c","mediaType":"application/pdf","name":"alien-ship-probes-pentagon-report.pdf","signedUrlTimeout":600,"size":243013,"storageKey":"2usbs7hat178pbdsn1dmhvbmg8","uploadKey":"cqkqo37c12dbm3mecl8g","uploadUrlTimeout":86400,"version":0}],"event":null,"id":"rec_cqkqo37c12dbm3mecl80","organization":"rec_cobdhj5bjt595h6377o0","summary":" In a draft research report co-authored with Harvard astronomer Abraham Loeb, Kirkpatrick stated:\n\n“[A]n artificial interstellar object could potentially be a parent craft that releases many small probes during its close passage to Earth, an operational construct not too dissimilar from NASA missions”[1][2][4].\n\nThe report discusses how such probes, likened to \"dandelion seeds,\" could be deployed to explore Earth and other planets, using starlight for energy and possibly Earth's resources for propulsion. Kirkpatrick and Loeb propose that these mini-probes might go unnoticed by current astronomical surveys due to their small size and low reflectivity[3][4].\n\nCitations:\n[1] https://www.militarytimes.com/off-duty/military-culture/2023/03/09/pentagon-ufo-chief-says-alien-mothership-in-our-solar-system-possible/\n[2] https://www.foxnews.com/science/pentagon-officials-suggest-alien-mothership-solar-system-send-mini-probes-earth\n[3] https://indianexpress.com/article/technology/science/alien-ship-probes-solar-system-pentagon-8525943/\n[4] https://www.politico.com/news/2023/04/14/pentagon-ufo-alien-object-00092108\n[5] https://www.youtube.com/watch?v=BeIcp1p6gRQ","witness":"rec_cqkqmkvc12dbm3mecl60","xata":{"createdAt":"2024-07-31 03:14:21.1354+00","updatedAt":"2024-07-31 03:14:21.1354+00","version":0}},{"claim":"There's a Flying Saucer Buried Near Garrison Utah so large the government could not move it","date":"2018-01-30 00:00:00+00","documentation":[{"attributes":{"height":542,"width":648},"enablePublicUrl":false,"id":"dn11aj3ub555n562t7r5tu4g34","mediaType":"image/jpeg","name":"John Lear Flying Saucer (1).jpg","signedUrlTimeout":600,"size":72753,"storageKey":"3l8jvp7jh151n7jph805cmklq0","uploadKey":"cqmfqsre3sl710hq3bpg","uploadUrlTimeout":86400,"version":1},{"enablePublicUrl":false,"id":"1d154plc2p6gn8b19brsttmub4","mediaType":"application/pdf","name":"Preterhuman.pdf","signedUrlTimeout":600,"size":142886,"storageKey":"4au6ln67u15f18ni7pab5k1ggc","uploadKey":"cqmfqt3e3sl710hq3bq0","uploadUrlTimeout":86400,"version":1}],"event":"rec_cqmfsvbe3sl710hq3bqg","id":"rec_cqmfqsre3sl710hq3bp0","organization":null,"summary":"The Huge Flying Saucer Buried Near Garrison Utah\nMany years ago there was a UFO conference here in Vegas and I went over to see a couple of friends. At the conference the Garrison Utah saucer crash was all the big rage.\nThere was report that I think was selling for about $30 which I bought and has disappeared from my library.\nIn 1953 a very large saucer crashed near Garrison Utah. It was about 150 to 200 feet in diameter. It was far too big for even the “Blue Berets” to move so it was decided to bury it on the spot.\nHundreds of soldiers with shovels began digging, days and weeks went by. Settling little by little they finally got the top of it about 50 feet below ground level.\nThey then started the massive job of shoveling the dirt back in and around and trying to make it look like nothing had ever happened.\nWhile all of the digging to bury the saucer was going on they also dug a tunnel from the saucer several hundred feet to the south where they built 2 or 3 houses.\nThe houses were constructed so that they looked like they were about 75 years old. They used old, weathered wood, old nails, old window frames and panes and old roofing The only way that you could tell from the outside that it might not be so old were the padlocks on the doors. Brand spanking new and of the highest quality.\nI don't remember what the interior was described as except that there was a door that led to a stairwell that led to the tunnel that led to the craft.\nNow all that I am telling you is what I remember from the report. And I believe the report was written by the guy that broke into the buildings. And my memory is not all that great.\nIn one of the houses was a type of log book in which visitors would write their names and organizations. It included Air Force, Navy, Army and many other military and civilian organizations.\nFour of the people at the conference, friends of mine and me decided to mount an expedition to Garrison. One friend had a helicopter and fuel truck, one had some underground radar tracking equipment (he had come up to my gold mine where about 5 miles away in an area not many people visited and where I had another claim named “Cutthroat”. The former name was  “Windmill” and produced a fair amount of gold.\nAbout 300 yards east from this claim there was an alleged Spanish treasure location. This treasure location had been found by somebody from the Phoenix area who had access to some Spanish treasure maps and this location was indicated on one of the maps.\nLocated in a pile of rocks was a perfectly square  cutout about 10 inches wide and about 16 inches deep. At the bottom was like concrete. I had the underground radar guys scan the area and found only a few possible returns. The area is now in an ACEC or Area of Critical Environmental Concern.\nAnyway we were all supposed to meet up in 2 weeks for the Garrison expedition but somehow we never got underway.\nAs far as I know the craft is still there. I have posted some photos of the area from Google Earth where it was buried. I put a circle around where the houses are. I say 'are' because they used to show up on Google Earth but now they are not there even though I think they are. There would be no reason to take the houses down. They would want access for ever. If they ever got the saucer cranked up it would be light duty to push up through 50 feet of dirt.\nThats all I know about the Garrison, Utah buried flying saucer. And I apologize to the originator of the story if I have not been entirely accurate.\nLat 38 degrees 37 minutes 40 seconds North\nLong  113 degrees 40 minutes 40 seconds West","witness":"rec_cobdfd4jmvif9dabl17g","xata":{"createdAt":"2024-08-02 15:38:28.331125+00","updatedAt":"2024-08-02 15:43:12.691284+00","version":1}},{"claim":"Edgar Mitchell introduced Uri Geller to an alien","date":null,"documentation":[],"event":null,"id":"rec_cqmk6rl5cg2i2qglvp2g","organization":null,"summary":"My dear friends , this type of alien is the one I have seen in the abyss of the concrete building Wernher Von Braun and astronaut Edgar Mitchell took me to see. Some bodies were not intact but mangled some were like the one in this video. To the best of my recollection there could have been 8 in glass containers. This is what I posted a while ago:\n\nI will say it again \u0026 again, over \u0026 over, Dr Wernher von Braun SHOWED me alien bodies that were somewhat similar to the ones in the video  – but their shape \u0026 decayed/injured state is certainly similar!). \n\nThey were being kept inside a massive, refrigerated room –  at least three flights of stairs beneath a building that is situated on a well-known NASA base! (Are they still being kept there? I don’t know…but look back at some at my previous posts on this subject, I have made it very clear where this was!)\n\nBefore we went in von Braun asked me to put on an orange, Antarctic-style warm coat - with the circular blue NASA logo on it - and he also put one on too.\n\nInside it smelled like a hospital.\n\nI could see what looked like heavy, glass containers, with lifeless bodies lying inside them. \n\nIt was a shocking sight! Like when you see an accident that has happened, and you feel like something has hit you in the stomach.\n\nThe containers looked like thick, triple-glazed, transparent coffins that were misted with frost along all of the edges and corners.\n\nThe bodies were small, thin \u0026 very frail looking with big heads. but disturbingly familiar. \n\nThey looked uncannily like us -enough for me to feel repulsed and sorry for seeing these “victims”. \n\nThey had either been severely injured or had decomposed a lot. But not all.\nNone of your cynical \u0026 sceptical scoffing comments will change what I have seen. \n\nFriends, please let me know your comments.\n And let me know if you think this footage of the alien is real or not. It certainly is very convincing.\n","witness":"rec_cqmjn155cg2i2qglvos0","xata":{"createdAt":"2024-08-02 20:37:02.24943+00","updatedAt":"2024-08-02 20:37:02.24943+00","version":0}},{"claim":"Jaime Maussan has briefed Tim Burchett on the Nazca Mummies\n","date":"2023-09-01 00:00:00+00","documentation":[],"event":null,"id":"rec_cqmo3bt5cg2i2qgm09e0","organization":null,"summary":"Jaime Maussan, an award-winning journalist from Mexico, has recently met with U.S. Congressman Tim Burchett to discuss the Nazca Mummies and UAP (Unidentified Anomalous Phenomena) disclosure[1].\n\nSome key points about this meeting and related events:\n\n1. Tim Burchett is known as a leading advocate for UAP non-human disclosure in the United States[1].\n\n2. Maussan has been involved in controversial presentations of alleged non-human remains. In September 2023, he presented what he claimed were two \"non-human\" bodies during a congressional hearing in Mexico City[3].\n\n3. Maussan stated that these specimens were approximately 1,000 years old, found in a Peruvian mine, and fossilized. He claimed that over 30% of their DNA was \"unknown\"[3].\n\n4. The bodies presented were described as having a roughly human structure but with only three fingers and toes, and unusual head shapes[3].\n\n5. Maussan's claims have been met with skepticism. In 2017, he made similar claims about a mummy found near the Nazca Lines in Peru, which was later debunked[3].\n\n6. The recent meeting between Maussan and Burchett suggests ongoing interest and discussion about these controversial topics among some public figures and officials.\n\nIt's important to note that while these claims generate significant public interest, they remain highly controversial and unverified by mainstream scientific institutions. The scientific community generally requires rigorous peer-reviewed evidence before accepting such extraordinary claims.\n\nCitations:\n[1] https://twitter.com/NazcaMummies/status/1819429466579370177\n[2] https://www.reddit.com/r/aliens/\n[3] https://metro.co.uk/2023/09/13/alien-bodies-unveiled-in-mexican-parliament-19491228/\n[4] https://www.marca.com/en/lifestyle/ufo.html\n[5] https://www.researchgate.net/publication/381405238_The_cryptoterrestrial_hypothesis_A_case_for_scientific_openness_to_a_concealed_earthly_explanation_for_Unidentified_Anomalous_Phenomena","witness":"rec_cqmo2kl5cg2i2qgm09d0","xata":{"createdAt":"2024-08-03 01:02:39.604335+00","updatedAt":"2024-08-03 01:02:39.604335+00","version":0}},{"claim":"The Aliens are coming in 2027. Full Disclosure of ET, NHI and our relationship to both is going to happen in 2027 claims John Ramirez.","date":"2022-12-20 00:00:00+00","documentation":[{"enablePublicUrl":false,"id":"a868k1p5rp5oj2mf4qjv6kj704","mediaType":"text/plain","name":"johnRamirezCiaRetUfosTheCiaMorePart2.txt","signedUrlTimeout":600,"size":71680,"storageKey":"b17vcv1ah12sf2i531ms4738ts","uploadKey":"cqopfg94e2oatj0cco3g","uploadUrlTimeout":86400,"version":0},{"enablePublicUrl":false,"id":"3j8r8pf8916u7c9jvv9i2v45gs","mediaType":"text/plain","name":"johnRamirezCiaRetiredUfosUapsEncountersPart1.txt","signedUrlTimeout":600,"size":94045,"storageKey":"6kbu0emfhd11leuevb9pq6239g","uploadKey":"cqopfg94e2oatj0cco40","uploadUrlTimeout":86400,"version":0}],"event":null,"id":"rec_cqopclp4e2oatj0cco1g","organization":"rec_cqopeb94e2oatj0cco2g","summary":"On Podcast UFO with Martin Wills, Ramirez claimed that government is aware of an impending event in 2027 which will reveal something quite significant so people are being prepared. He has been stating that there is a presence on Earth (which he refers demonic) who are just projecting their own belief systems to make us disbelieve in what we believe. Wills asked Ramirez what would happen if there was mass Landing? would we just simply prepare for a conflict or would we actually initiate something?\n\n“I think the dialogue we have now in this country, even with the recent legislation that passed through the legislature and is on its way up to the president’s desk, is preparing the U.S population, and by extension the world population, for the reality that there is a presence here that we need to explain. If they show up and we continue to do what we did before in previous decades, there will be mass panic. However, if we understand that these are real and we have five years from 2022, or maybe now four years, if they come in 2027, for the US government to prepare the people about what is up there.\n\nIn many ways, I think the word got out within the government that they’re showing up in 2027, and we better be prepared. If not, there’s going to be a lot of explaining to do. So, I think that dialogue has happened within certain areas inside the government, that we need to prepare.\n\nThat’s why in 2017, that set a clock of 10 years, and why Lou Elizondo earlier in this year said, “Just find a hobby for five years, and it’ll all be out in five years,” and he said that this year, so that was 2027. I’ve heard 2027 in an official capacity, and I can’t reveal, so I would say that people in the government are aware of something happening, and there’s limited time, a few more years to prepare the people. That’s what’s wrapping up this acceleration from the previous seven decades of not even acknowledging it to now acknowledging it at a faster and faster pace.”","witness":"rec_cqop98pr6b4utrbc44mg","xata":{"createdAt":"2024-08-06 03:19:51.941429+00","updatedAt":"2024-08-06 03:25:53.446947+00","version":1}},{"claim":"Truth About UFOs Is Terrifying \u0026 Interdimensional Beings Are Within Us. \"there’s a whole other reality that surrounds us that we just simply don’t have the ability to see or interact with.\"","date":null,"documentation":[],"event":null,"id":"rec_cqoq4hhr6b4utrbc44og","organization":"rec_cobdhj5bjt595h6377u0","summary":"\"There’s an entity out there! There’s some kind of non-human intelligence that’s living with us on this F**KING planet\". I think they mention that the phenomenon is a natural part of our universe, and we’re living in it but we don’t recognize it. The same way that insects and animals don’t recognize the human universe. A cat and a dog could be running through a library, but they don’t have the faintest idea what the books are all about and what libraries are all about. We might be walking through our existence and there’s a whole other reality that surrounds us that we just simply don’t have the ability to see or interact with.","witness":"rec_cqff5k20hn8didc5u610","xata":{"createdAt":"2024-08-06 04:10:46.820543+00","updatedAt":"2024-08-06 04:10:46.820543+00","version":0}},{"claim":"At least one of them was part of an archaeological dig. So… it’s old. At least one of them is old. I don’t know if it was the one I worked on, but I remember something to do with an archaeological dig. That means it’s not just old, it’s ancient.","date":"2019-06-01 00:00:00+00","documentation":[],"event":null,"id":"rec_cqskjep6d13uddfma980","organization":null,"summary":"Bob Lazar reported that at least one of the UFOs present at Los Alamos was found at an archaeological dig site","witness":"rec_cobdfd4jmvif9dabl0i0","xata":{"createdAt":"2024-08-11 23:31:07.53777+00","updatedAt":"2024-08-11 23:31:07.53777+00","version":0}}],"total":0}
